app/controllers/school_classes_controller.rb

INSERT INTO "school_classes" ("title", "room_number") VALUES (?, ?)  [["title", "Intro to Cooking"], ["room_number", 24]]
---
    def create
        @class = SchoolClass.create(safety)

SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
---
    def find_class
        @class = SchoolClass.find(params[:id])