app/controllers/students_controller.rb

INSERT INTO "students" ("first_name", "last_name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["first_name", "Milan "], ["last_name", "Winter"], ["created_at", "2020-10-30 05:14:54.256658"], ["updated_at", "2020-10-30 05:14:54.256658"]]
---
    def create
        @student = Student.create(safety)

SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 12], ["LIMIT", 1]]
---
    def find_kid
        @student = Student.find(params[:id])